Tekla Open API Reference for Tekla Structures 2025
Arc.Attributes Property
 The attributes of the arc.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Arc.ArcAttributes Attributes { get; set; }
Public Property Attributes As Arc.ArcAttributes
	Get
	Set
Property Value
Type: Arc.ArcAttributes
See Also
Reference
Arc Class
Tekla.Structures.Drawing Namespace